#include<iostream>

int main()
{
    // За рожденият ден на дъщеря си, Ивет е решила да организира
    // парти, на което да покани всичките ѝ съученици. За целта е решила
    // да наеме развлекателна зала за деца, чийто наем ще получите като
    // вход от конзолата.
    // Напишете програма, с която да помогнете на Ивет да изчисли какъв
    // бюджет ще ѝ бъде необходим, като имате следната информация за
    // допълнителните неща, необходими за тържеството:
    // Торта – цената ѝ е 20% от наема на залата
    // Напитки – цената им е 45% по-малко от тази на тортата
    // Аниматор – цената му е 1/3 от цената за наема на залата
    double hallRent;
    std::cin >> hallRent; // 150
    
    double cakePrice = hallRent * 0.2; // 30
    double drinksPrice = cakePrice * 0.55; // 16.5
    double animatorPrice = hallRent / 3; // 50
    
    double neededFunds = hallRent + cakePrice + drinksPrice + animatorPrice;
    std::cout << "Needed funds:" << neededFunds << std::endl;
    return 0;
}